RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h730xx.s
        PUBWEAK SWPMI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SWPMI1_IRQHandler 
        B SWPMI1_IRQHandler

        PUBWEAK TIM15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM15_IRQHandler 
        B TIM15_IRQHandler

        PUBWEAK TIM16_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM16_IRQHandler 
        B TIM16_IRQHandler

        PUBWEAK TIM17_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM17_IRQHandler 
        B TIM17_IRQHandler

        PUBWEAK MDIOS_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_WKUP_IRQHandler 
        B MDIOS_WKUP_IRQHandler

        PUBWEAK MDIOS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_IRQHandler 
        B MDIOS_IRQHandler

        PUBWEAK MDMA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDMA_IRQHandler 
        B MDMA_IRQHandler

        PUBWEAK SDMMC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC2_IRQHandler 
        B SDMMC2_IRQHandler

        PUBWEAK HSEM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HSEM1_IRQHandler 
        B HSEM1_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
ADC3_IRQHandler 
        B ADC3_IRQHandler

        PUBWEAK DMAMUX2_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DMAMUX2_OVR_IRQHandler 
        B DMAMUX2_OVR_IRQHandler

        PUBWEAK BDMA_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel0_IRQHandler 
        B BDMA_Channel0_IRQHandler

        PUBWEAK BDMA_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel1_IRQHandler 
        B BDMA_Channel1_IRQHandler

        PUBWEAK BDMA_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel2_IRQHandler 
        B BDMA_Channel2_IRQHandler

        PUBWEAK BDMA_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel3_IRQHandler 
        B BDMA_Channel3_IRQHandler

        PUBWEAK BDMA_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel4_IRQHandler 
        B BDMA_Channel4_IRQHandler

        PUBWEAK BDMA_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel5_IRQHandler 
        B BDMA_Channel5_IRQHandler

        PUBWEAK BDMA_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel6_IRQHandler 
        B BDMA_Channel6_IRQHandler

        PUBWEAK BDMA_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel7_IRQHandler 
        B BDMA_Channel7_IRQHandler

        PUBWEAK COMP1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
COMP1_IRQHandler 
        B COMP1_IRQHandler

        PUBWEAK LPTIM2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM2_IRQHandler 
        B LPTIM2_IRQHandler

        PUBWEAK LPTIM3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM3_IRQHandler 
        B LPTIM3_IRQHandler

        PUBWEAK LPTIM4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM4_IRQHandler 
        B LPTIM4_IRQHandler

        PUBWEAK LPTIM5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM5_IRQHandler 
        B LPTIM5_IRQHandler	

        PUBWEAK LPUART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPUART1_IRQHandler 
        B LPUART1_IRQHandler

        PUBWEAK CRS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CRS_IRQHandler 
        B CRS_IRQHandler

        PUBWEAK ECC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
ECC_IRQHandler 
        B ECC_IRQHandler

        PUBWEAK SAI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SAI4_IRQHandler 
        B SAI4_IRQHandler

        PUBWEAK DTS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DTS_IRQHandler 
        B DTS_IRQHandler

        PUBWEAK WAKEUP_PIN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
WAKEUP_PIN_IRQHandler 
        B WAKEUP_PIN_IRQHandler

        PUBWEAK OCTOSPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OCTOSPI2_IRQHandler 
        B OCTOSPI2_IRQHandler

        PUBWEAK OTFDEC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTFDEC1_IRQHandler 
        B OTFDEC1_IRQHandler

        PUBWEAK OTFDEC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTFDEC2_IRQHandler 
        B OTFDEC2_IRQHandler

        PUBWEAK FMAC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
FMAC_IRQHandler 
        B FMAC_IRQHandler

        PUBWEAK CORDIC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CORDIC_IRQHandler 
        B CORDIC_IRQHandler

        PUBWEAK UART9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
UART9_IRQHandler 
        B UART9_IRQHandler

        PUBWEAK USART10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
USART10_IRQHandler 
        B USART10_IRQHandler

        PUBWEAK I2C5_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
I2C5_EV_IRQHandler 
        B I2C5_EV_IRQHandler

        PUBWEAK I2C5_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
I2C5_ER_IRQHandler 
        B I2C5_ER_IRQHandler

        PUBWEAK FDCAN3_IT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN3_IT0_IRQHandler 
        B FDCAN3_IT0_IRQHandler

        PUBWEAK FDCAN3_IT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN3_IT1_IRQHandler 
        B FDCAN3_IT1_IRQHandler

        PUBWEAK TIM23_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM23_IRQHandler 
        B TIM23_IRQHandler

        PUBWEAK TIM24_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM24_IRQHandler 
        B TIM24_IRQHandler			
		
        END
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
